# -*- coding: utf-8 -*-
import numpy as np


"""
一，改变shape
"""
# a = np.floor(np.random.random((3,4)) * 10)
a = np.arange(12).reshape(2,2,3)
print(a)


"""
[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
"""

print(a.ravel())

"""
返回一维  flat
[ 0  1  2  3  4  5  6  7  8  9 10 11]
"""


print(a.T)

"""
转置 矩阵：

[[ 0  4  8]
 [ 1  5  9]
 [ 2  6 10]
 [ 3  7 11]]
"""

print a.T.shape


a.resize(2,6)
print(a)
"""
resize 会修改本身 结构
[[ 0  1  2  3  4  5]
 [ 6  7  8  9 10 11]]
"""


print(a.reshape(2,3,-1))

"""
如果reshape 有一个维度为负数，其他的维度自动计算。不能同时有两个负数
[[[ 0  1]
  [ 2  3]
  [ 4  5]]

 [[ 6  7]
  [ 8  9]
  [10 11]]]
"""



"""
二，连接不同矩阵
"""

a = np.floor(10*np.random.random((2,2)))
print(a)

"""
[[ 7.  7.]
 [ 6.  3.]]
"""

b = np.floor(10*np.random.random((2,2)))
print(b)
"""
[[ 2.  3.]
 [ 3.  4.]]
"""

print(np.vstack((a,b)))
"""
垂直连接
[[ 7.  7.]
 [ 6.  3.]
 [ 2.  3.]
 [ 3.  4.]]
"""

print(np.hstack((a,b)))

"""
水平连接
[[ 7.  7.  2.  3.]
 [ 6.  3.  3.  4.]]
"""



"""
三，将一个数组拆成几个更小的数组
"""

a = np.floor(10*np.random.random((2,12)))
print(a)
"""
[[ 1.  1.  8.  3.  4.  1.  7.  2.  8.  9.  5.  7.]
 [ 8.  1.  4.  3.  0.  4.  6.  7.  3.  0.  2.  3.]]
"""

print(np.hsplit(a,3))
"""
水平分割数组 ，分割成3组

[array([[ 1.,  1.,  8.,  3.],
       [ 8.,  1.,  4.,  3.]]), array([[ 4.,  1.,  7.,  2.],
       [ 0.,  4.,  6.,  7.]]), array([[ 8.,  9.,  5.,  7.],
       [ 3.,  0.,  2.,  3.]])]
"""

print(np.hsplit(a,(3,4)))

"""
以列序数为 3 开始 到序数为4（不包括4 ） 作为一组分开
[array([[ 1.,  1.,  8.],
       [ 8.,  1.,  4.]]), array([[ 3.],
       [ 3.]]), array([[ 4.,  1.,  7.,  2.,  8.,  9.,  5.,  7.],
       [ 0.,  4.,  6.,  7.,  3.,  0.,  2.,  3.]])]
"""

print(np.vsplit(a,2))
"""
分成两列：
[array([[ 1.,  1.,  8.,  3.,  4.,  1.,  7.,  2.,  8.,  9.,  5.,  7.]]), array([[ 8.,  1.,  4.,  3.,  0.,  4.,  6.,  7.,  3.,  0.,  2.,  3.]])]
"""

print(np.vsplit(a,(3,4)))
"""
因为没有 行号 为 3 的。所以最后一个为空:
[array([[ 1.,  1.,  8.,  3.,  4.,  1.,  7.,  2.,  8.,  9.,  5.,  7.],
       [ 8.,  1.,  4.,  3.,  0.,  4.,  6.,  7.,  3.,  0.,  2.,  3.]]), array([], shape=(0L, 12L), dtype=float64), array([], shape=(0L, 12L), dtype=float64)]
"""

