# -*- coding: utf-8 -*-
import numpy as np


"""
三，将一个数组拆成几个更小的数组
"""

a = np.floor(10*np.random.random((2,12)))
print(a)
"""
[[ 1.  1.  8.  3.  4.  1.  7.  2.  8.  9.  5.  7.]
 [ 8.  1.  4.  3.  0.  4.  6.  7.  3.  0.  2.  3.]]
"""

print(np.hsplit(a,3))
"""
水平分割数组 ，分割成3组

[array([[ 1.,  1.,  8.,  3.],
       [ 8.,  1.,  4.,  3.]]), array([[ 4.,  1.,  7.,  2.],
       [ 0.,  4.,  6.,  7.]]), array([[ 8.,  9.,  5.,  7.],
       [ 3.,  0.,  2.,  3.]])]
"""

print(np.hsplit(a,(3,4)))

"""
以列序数为 3 开始 到序数为4（不包括4 ） 作为一组分开
[array([[ 1.,  1.,  8.],
       [ 8.,  1.,  4.]]), array([[ 3.],
       [ 3.]]), array([[ 4.,  1.,  7.,  2.,  8.,  9.,  5.,  7.],
       [ 0.,  4.,  6.,  7.,  3.,  0.,  2.,  3.]])]
"""

print(np.vsplit(a,2))
"""
分成两列：
[array([[ 1.,  1.,  8.,  3.,  4.,  1.,  7.,  2.,  8.,  9.,  5.,  7.]]), array([[ 8.,  1.,  4.,  3.,  0.,  4.,  6.,  7.,  3.,  0.,  2.,  3.]])]
"""

print(np.vsplit(a,(3,4)))
"""
因为没有 行号 为 3 的。所以最后一个为空:
[array([[ 1.,  1.,  8.,  3.,  4.,  1.,  7.,  2.,  8.,  9.,  5.,  7.],
       [ 8.,  1.,  4.,  3.,  0.,  4.,  6.,  7.,  3.,  0.,  2.,  3.]]), array([], shape=(0L, 12L), dtype=float64), array([], shape=(0L, 12L), dtype=float64)]
"""

